package module9

fun mai() {
/*

                                             Определение ООП

       Цель:
       Узнать что такое объектно-ориентированиое программирование

       ПРОЦЕДУРНОЕ ПРОГРАММИРОВАНИЕ
       Парадигма - способ мышления, восприятия.
       Процедурное программирование - самая простая парадигма. Последовательное выполнение каких-либо команд.

        Объектно-ориентированное программирование - представление программы в виде объектов и взаимоотношений между ними.

        Объект-что-то, что имеет свое состояние и поведение: мобильный телефон, компьютер, дерево, ручка для письма и т.д.


        Принцыпы ООП
        - инкапсуляция
        - наследование
        - полиморфизм
        Дополнительно рассматривают четвертый принцип, который относится ко всем парадигмам:
        - абстракция

        Инкапсуляция
        - языковая структура, позволяющая связать данные с методами, предназначенными для обработки этих данных
        - механизм языка, позволяющий ограничить доступ одних компонентов программы к другим

        Для чего нужна инкапсуляция:
        - скрыть от пользователя детали реализации класса
        - представить определенные интерфейсы для взаимодействия с классом
        Это обеспечит:
        - максимально стабильную и прогнозируемую работу программы
        - максимально простое взаимодействие между компонентами
 */
}