package module6

fun main() {

   /*                                           Рекурсия

  Задачи:
  - рассмотреть особенности рекурсии
  - научиться создавать собственные рекурсии

  Рекурсия - способ организации обработки данных, при котором программа или функция вызывает сама себя напрямую,
  либо с помощью других программ.

  Любой итеративный алгоритм может быть представлен в виде рекурсии.

  А каждая рекурсия может быть представлена в виде цикла

  fun calculateSum(n: Int): Int {
        return if (n == 0) 0
        else n + calculateSum(n - 1)
  }





 */
}