package module7

fun main() {
    /*                                      Коллекции

    Цели:
    - определить что такое коллекция
    - узнать какие бывают коллекции
    - разобраться, как классифицируются коллекции

    Коллекция - структура данных, позволяющая содержать в себе набор значений одного или различных типов и
    обращаться к этим значениям.

    Коллекции разделяют на группы по следующим характеристикам:
    - возможность изменения начального набора данных
    - возможность хранения одного или нескольких типов данных
    - способ организации данных и доступа к ним

    По способу организации данных коллекции делятся на несколько видов:
    - Array - массив
    - List - список
    - Set - множество
    - Map - ассоциативный массив/ представление / словарь



    */

}